/*
 * ACM1602.h
 *
 *  Created on: 2020/10/03
 *      Author: MIBC
 */
#include "platform.h"
#include "r_sci_iic_rx_if.h"

//========================================================================
// ACM1602 初期化
// ※ACM1602を使用する場合は、処理開始ルーチンで1回だけコールしてください
// [freertos_start.cのProcessing_Before_Start_Kernelでコールするのがベストかも…]
//========================================================================
sci_iic_return_t ACM1602_Initalize(void);

// ▼---[ 以下、タスク内部でコール可能 ]------------------------------------------------▼
//========================================================================
// ディスプレイクリア
//========================================================================
sci_iic_return_t ACM1602_ClearDisplay(void);


//========================================================================
// カーソルリセット
//========================================================================
sci_iic_return_t ACM1602_ReturnHome(void);


//========================================================================
// エントリモード設定
//    CoursorMobing : カーソル移動有無 [0：OFF / 1:ON]
//    EnableShift   : シフト有無             [0:OFF / 1:ON]
//========================================================================
sci_iic_return_t ACM1602_SetEntryMode(uint8_t CursorMoving, uint8_t EnableShift);


//========================================================================
// ディスプレイ制御
//     Display : ディスプレイON/OFF  [0:OFF / 1:ON]
//     Cursor  : カーソルON/OFF    [0:OFF / 1:ON]
//     Blink   : カーソル点滅ON/OFF [0:OFF / 1:ON]
//========================================================================
sci_iic_return_t ACM1602_DisplayControl(uint8_t Display, uint8_t Cursor, uint8_t Blink);


//========================================================================
// ファンクション設定
//     DataLentgh  : データ長                [0:4-bit / 1:8-bit]
//     DisplayLine : ディスプレイライン   [0:1-Line / 1:2-Line]
//     DisplayFont : ディスプレイフォント [0:5x8 dots / 1:5x10 dots]
//========================================================================
sci_iic_return_t ACM1602_SetFunction(uint8_t DataLength, uint8_t DisplayLine, uint8_t DisplayFont);


//========================================================================
// カーソル位置設定
//     x : ディスプレイX座標 [0 - 15]
//     y : ディスプレイy座標 [0 - 1]
//========================================================================
sci_iic_return_t ACM1602_SetLocate(uint8_t x, uint8_t y);


//========================================================================
// 表示
//     *pData   : 表示データ
//     DataSize : 表示データ数
//========================================================================
sci_iic_return_t ACM1602_Print(const uint8_t *pData, uint8_t DataSize);










